Revit 2020 API
AdvancedOpaque Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class AdvancedOpaque
Visual Basic
Public NotInheritable Class AdvancedOpaque
Visual C++
public ref class AdvancedOpaque abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AdvancedOpaque
See Also
AdvancedOpaque Members
Autodesk.Revit.DB.Visual Namespace